{
  "title": "Venue Supervisor",
  "contents": [
    "Benefits\\r\\nPulled from the full job description\\r\\n\\r\\nReferral programme\\r\\nCycle to work scheme\\r\\n&nbsp;\\r\\nFull job description\\r\\nSchools Plus Ltd hires out schools facilities when the school day is over.\\r\\n\\r\\nAs a Venue Supervisor you will work shifts and take ownership of the events taking place.\\r\\n\\r\\nPEOPLE SKILLS: This is a great job for someone who loves meeting people. You must be confident, friendly and amenable with all our customers. Attention to detail and thoroughness are essential - both our customers and the School expect a high quality service. Our staff form great relationships with our regular customers.\\r\\n\\r\\nRESPONSIBILITY: You will be given full training in all aspects of the job. You must have common sense and be able to use your initiative to solve problems and deal with emergencies as and when they arise. You will often be working on your own, taking responsibility for the smooth running of the site and the well-being of everyone there. Your Team Leader and Venue Manager are available to support you.\\r\\n\\r\\nThis position will suit a person who is punctual and well organised, who thrives when given real responsibility and independence.\\r\\n\\r\\nTasks will include:\\r\\n\\r\\nOpening up the site, preparing rooms, locking up the site at the end of the shift\\r\\nInteracting with our customers: signing them in, providing assistance, making sure they are using their allocated rooms, etc.\\r\\nCleaning up after activities and returning rooms as the school would expect to find them.\\r\\nFLEXIBILITY WITH SECURITY: The hours we can offer will depend on your availability and the changing needs at the schools but please be aware that shifts take place in the evenings, weekends and during school holidays as well as during the school day.\\r\\n\\r\\nYou can decide how many hours you are available over the coming weeks, and confirm your rota with your manager. Once we\\u2019ve both committed to the rota, we will honour it, even if the bookings get cancelled for some reason. We expect you to do the same.\\r\\n\\r\\nBE PART OF A TEAM: You will not only be part of the team at your sites, you will also be welcomed into the Schools Plus family. We\\u2019ve been managing lettings for 17 years and we have a terrific support network.\\r\\n\\r\\nOPPORTUNITY: Many of our Venue Supervisors have gone on to other roles within the company, including Team Leaders, Venue Managers and even the HR & Compliance Director. 84% of our Team Leaders have progressed from Venue Supervisor!\\r\\n\\r\\nThere are always opportunities to develop your career, if that\\u2019s what you\\u2019re looking for.\\r\\n\\r\\nDue to the lone working nature of this position and the supervision of customers, applicants must be over the age of 18.\\r\\n\\r\\nWe are committed to the highest standards of child protection. We rigorously vet all candidates, including police checks. All employees are subject to ongoing monitoring for child protection purposes.\\r\\n\\r\\nSchools Plus is an Equal Opportunities employer, and we welcome your application.\\r\\n\\r\\nJob Types: Part-time, Permanent\\r\\n\\r\\nPay: \\u00A312.39 per hour\\r\\n\\r\\nExpected hours: 10 \\u2013 15 per week\\r\\n\\r\\nBenefits:\\r\\n\\r\\nCycle to work scheme\\r\\nReferral programme\\r\\nWork Location: In person"
  ]
}